# Module 3: The WHERE Clause to filter results

## Lab 1

WHERE clause operators 

• =, \<\>, != 

• \<, \>, \<=, \>= 

• BETWEEN 

• LIKE (with wildcards %,\_ and more) 

• IN 

• AND, OR for multiple expressions 

• NOT 

• Parentheses to enforce logic

\-----------------------------------------------------------------------------------

\--Compare a column to a value 

SELECT column1, column2, column3 

FROM theTable 

WHERE column1 = 1;

\-----------------------------------------------------------------------------------  

\--Use tick marks with dates and strings 

SELECT column1, column2, column3 

FROM theTable 

WHERE column2 = '2011-06-07' AND column3 = 'test'; 

\-----------------------------------------------------------------------------------  

\--**BETWEEN** is inclusive, this will return rows where column1 = 1,2,3,4, or 5

SELECT column1, column2, column3 

FROM theTable 

WHERE column1 BETWEEN 1 AND 5; 

\-----------------------------------------------------------------------------------  

\--Use **IN** for a list 

SELECT column1, column2, column3 

FROM theTable 

WHERE column1 IN (1,2,3); 

\-----------------------------------------------------------------------------------  

\--**AND** means both expressions must return true. **OR** means at least one expression must return true 

SELECT column1, column2, column3 

FROM theTable 

WHERE column1 = 1 OR column2 \< '2011-06-07'

\-----------------------------------------------------------------------------------  

\--Use parenthesis to enforce logic 

SELECT column1, column2, column3 

FROM theTable 

WHERE (column1 = 1 OR column2 \>= '2011-06-07') AND column3 = 'test'; 

\-----------------------------------------------------------------------------------  

\--**NOT** negates the expression 

SELECT column1, column2, column3 

FROM theTable 

WHERE NOT (column1 = 1 OR column2 = '2011-06-07') AND column3 = 'test';

\-----------------------------------------------------------------------------------  

\--**ORDER BY** is after **WHERE**

SELECT column1, column2, column3

FROM theTable

WHERE column1  =1

ORDER BY column2;

Use AdventureWorks 2019

  

1. Write a query using a WHERE clause that displays all the employees listed in the HumanResources.Employee table who have the job title “Research and Development Engineer”. Display the BusinessEntityID, LoginID, and the JobTitle for each one. Remember to use tick marks around values in the WHERE clause.

2\. Write a query displaying all the columns of the Production.ProductCostHistory table from the rows in which the standard cost is between the values of $10 and $13.

3\. Write a query finding the name Mary Gibson from the Person.Person table. Return the BusinessEntityID, FirstName, and LastName columns.

4\. Change the query in question 3 so that the results are returned in order of the LastName.

## Lab 2

Notes about **NULL** 

**NULL** means **UNKNOWN**, not FALSE, not an empty string, not zero. 

Nothing can be compared to **NULL** and most expressions containing **NULL** return **NULL**. 

\-----------------------------------------------------------------------------------

\--Use **ISNULL** or **COALESCE** to replace NULL 

SELECT ISNULL(column1, 'N/A') AS Column1 

FROM theTable; 

SELECT COALESCE(column1, column2, column3) AS TheAnswer 

FROM theTable;

\--Use ISNULL  

SELECT ISNULL(column1) + ISNULL(column2) AS NewColumn

FROM theTable;

\-----------------------------------------------------------------------------------

\--Use **IS NULL** or **IS NOT NULL** to compare NULL 

SELECT column1, column2, column3 

FROM theTable WHERE column1 IS NULL; 

SELECT column1, column2, column3 

FROM theTable 

WHERE column1 IS NOT NULL;

\-----------------------------------------------------------------------------------

\--Use **ISNULL** or **COALESCE** in the WHERE clause if there are NULLs in the column

SELECT column1, column2, column3

FROM the table

WHERE ISNULL(column1,'') = 'Blue';

SELECT column1, column2, column3

FROM the table

WHERE COALESCE(column1,'') = 'Blue';

1\. Return the SalesOrderID, OrderDate, and CurrencyRateID from the Sales.SalesOrderHeader table where there is no currency rate ID.

2\. Rewrite the query in Question 1 so that it returns rows with a currency rate of 1536 or no currency rate.

3. Write a query using the Person.Person table. Return BusinessEntityID, FirstName, MiddleName, LastName and a FullName column that includes all three parts of the name.